# Формат вывода
# Выведите значение квадратного корня из двух с точностью 5 знаков после запятой

# Примечания
# Функцией, вычисляющей корень, из стандартной библиотеки пользоваться нельзя.

x = 2
print('{:.5f}'.format(x** 0.5))